ARMmbed/mbed-os/targets/TARGET_Silicon_Labs/TARGET_EFM32/TARGET_EFR32FG12/device/efr32fg12p231f1024gm48.h
/** Flash and SRAM limits for EFR32FG12P231F1024GM48 */
#define FLASH_BASE                 (0x00000000UL) /**< Flash Base Address */
#define FLASH_SIZE                 (0x00100000UL) /**< Available Flash Memory */
#define FLASH_PAGE_SIZE            2048           /**< Flash Memory page size (interleaving off) */
#define SRAM_BASE                  (0x20000000UL) /**< SRAM Base Address */
#define SRAM_SIZE                  (0x00020000UL) /**< Available SRAM Memory */
#define __CM4_REV                  0x001          /**< Cortex-M4 Core revision r0p1 */
#define PRS_CHAN_COUNT             12             /**< Number of PRS channels */
#define DMA_CHAN_COUNT             8              /**< Number of DMA channels */
#define EXT_IRQ_COUNT              51             /**< Number of External (NVIC) interrupts */

/** AF channels connect the different on-chip peripherals with the af-mux */
#define AFCHAN_MAX                 136
#define AFCHANLOC_MAX              32
/** Analog AF channels */
#define AFACHAN_MAX                125

/* Part number capabilities */

#define CRYPTO_PRESENT        /**< CRYPTO is available in this part */
#define CRYPTO_COUNT        2 /**< 2 CRYPTOs available  */
#define TIMER_PRESENT         /**< TIMER is available in this part */
#define TIMER_COUNT         2 /**< 2 TIMERs available  */
#define WTIMER_PRESENT        /**< WTIMER is available in this part */
#define WTIMER_COUNT        2 /**< 2 WTIMERs available  */
#define USART_PRESENT         /**< USART is available in this part */
#define USART_COUNT         4 /**< 4 USARTs available  */
#define LEUART_PRESENT        /**< LEUART is available in this part */
#define LEUART_COUNT        1 /**< 1 LEUARTs available  */
#define LETIMER_PRESENT       /**< LETIMER is available in this part */
#define LETIMER_COUNT       1 /**< 1 LETIMERs available  */
#define PCNT_PRESENT          /**< PCNT is available in this part */
#define PCNT_COUNT          3 /**< 3 PCNTs available  */
#define I2C_PRESENT           /**< I2C is available in this part */
#define I2C_COUNT           2 /**< 2 I2Cs available  */
#define ADC_PRESENT           /**< ADC is available in this part */
#define ADC_COUNT           1 /**< 1 ADCs available  */
#define ACMP_PRESENT          /**< ACMP is available in this part */
#define ACMP_COUNT          2 /**< 2 ACMPs available  */
#define IDAC_PRESENT          /**< IDAC is available in this part */
#define IDAC_COUNT          1 /**< 1 IDACs available  */
#define VDAC_PRESENT          /**< VDAC is available in this part */
#define VDAC_COUNT          1 /**< 1 VDACs available  */
#define WDOG_PRESENT          /**< WDOG is available in this part */
#define WDOG_COUNT          2 /**< 2 WDOGs available  */
#define TRNG_PRESENT          /**< TRNG is available in this part */
#define TRNG_COUNT          1 /**< 1 TRNGs available  */
#define SYSTICK_PRESENT
#define SYSTICK_COUNT       1
#define MSC_PRESENT
#define MSC_COUNT           1
#define EMU_PRESENT
#define EMU_COUNT           1
#define RMU_PRESENT
#define RMU_COUNT           1
#define CMU_PRESENT
#define CMU_COUNT           1
#define GPIO_PRESENT
#define GPIO_COUNT          1
#define PRS_PRESENT
#define PRS_COUNT           1
#define LDMA_PRESENT
#define LDMA_COUNT          1
#define FPUEH_PRESENT
#define FPUEH_COUNT         1
#define GPCRC_PRESENT
#define GPCRC_COUNT         1
#define CRYOTIMER_PRESENT
#define CRYOTIMER_COUNT     1
#define CSEN_PRESENT
#define CSEN_COUNT          1
#define LESENSE_PRESENT
#define LESENSE_COUNT       1
#define RTCC_PRESENT
#define RTCC_COUNT          1
#define ETM_PRESENT
#define ETM_COUNT           1
#define BOOTLOADER_PRESENT
#define BOOTLOADER_COUNT    1
#define SMU_PRESENT
#define SMU_COUNT           1

#include "core_cm4.h"          /* Cortex-M4 processor and core peripherals */
#include "system_efr32fg12p.h" /* System Header File */

/** @} End of group EFR32FG12P231F1024GM48_Part */

/**************************************************************************//**
 * @defgroup EFR32FG12P231F1024GM48_Peripheral_TypeDefs EFR32FG12P231F1024GM48 Peripheral TypeDefs
 * @{
 * @brief Device Specific Peripheral Register Structures
 *****************************************************************************/

#include "efr32fg12p_msc.h"
#include "efr32fg12p_emu.h"
#include "efr32fg12p_rmu.h"
#include "efr32fg12p_cmu.h"
#include "efr32fg12p_crypto.h"
#include "efr32fg12p_gpio_p.h"
#include "efr32fg12p_gpio.h"
#include "efr32fg12p_prs_ch.h"
#include "efr32fg12p_prs.h"
#include "efr32fg12p_ldma_ch.h"
#include "efr32fg12p_ldma.h"
#include "efr32fg12p_fpueh.h"
#include "efr32fg12p_gpcrc.h"
#include "efr32fg12p_timer_cc.h"
#include "efr32fg12p_timer.h"
#include "efr32fg12p_usart.h"
#include "efr32fg12p_leuart.h"
#include "efr32fg12p_letimer.h"
#include "efr32fg12p_cryotimer.h"
#include "efr32fg12p_pcnt.h"
#include "efr32fg12p_i2c.h"
#include "efr32fg12p_adc.h"
#include "efr32fg12p_acmp.h"
#include "efr32fg12p_idac.h"
#include "efr32fg12p_vdac_opa.h"
#include "efr32fg12p_vdac.h"
#include "efr32fg12p_csen.h"
#include "efr32fg12p_lesense_st.h"
#include "efr32fg12p_lesense_buf.h"
#include "efr32fg12p_lesense_ch.h"
#include "efr32fg12p_lesense.h"
#include "efr32fg12p_rtcc_cc.h"
#include "efr32fg12p_rtcc_ret.h"
#include "efr32fg12p_rtcc.h"
#include "efr32fg12p_wdog_pch.h"
#include "efr32fg12p_wdog.h"
#include "efr32fg12p_etm.h"
#include "efr32fg12p_smu.h"
#include "efr32fg12p_trng.h"
#include "efr32fg12p_dma_descriptor.h"
#include "efr32fg12p_devinfo.h"
#include "efr32fg12p_romtable.h"

/** @} End of group EFR32FG12P231F1024GM48_Peripheral_TypeDefs  */

/**************************************************************************//**
 * @defgroup EFR32FG12P231F1024GM48_Peripheral_Base EFR32FG12P231F1024GM48 Peripheral Memory Map
 * @{
 *****************************************************************************/

#define MSC_BASE          (0x400E0000UL) /**< MSC base address  */
#define EMU_BASE          (0x400E3000UL) /**< EMU base address  */
#define RMU_BASE          (0x400E5000UL) /**< RMU base address  */
#define CMU_BASE          (0x400E4000UL) /**< CMU base address  */
#define CRYPTO0_BASE      (0x400F0000UL) /**< CRYPTO0 base address  */
#define CRYPTO_BASE       CRYPTO0_BASE   /**< Alias for CRYPTO0 base address */
#define CRYPTO1_BASE      (0x400F0400UL) /**< CRYPTO1 base address  */
#define GPIO_BASE         (0x4000A000UL) /**< GPIO base address  */
#define PRS_BASE          (0x400E6000UL) /**< PRS base address  */
#define LDMA_BASE         (0x400E2000UL) /**< LDMA base address  */
#define FPUEH_BASE        (0x400E1000UL) /**< FPUEH base address  */
#define GPCRC_BASE        (0x4001C000UL) /**< GPCRC base address  */
#define TIMER0_BASE       (0x40018000UL) /**< TIMER0 base address  */
#define TIMER1_BASE       (0x40018400UL) /**< TIMER1 base address  */
#define WTIMER0_BASE      (0x4001A000UL) /**< WTIMER0 base address  */
#define WTIMER1_BASE      (0x4001A400UL) /**< WTIMER1 base address  */
#define USART0_BASE       (0x40010000UL) /**< USART0 base address  */
#define USART1_BASE       (0x40010400UL) /**< USART1 base address  */
#define USART2_BASE       (0x40010800UL) /**< USART2 base address  */
#define USART3_BASE       (0x40010C00UL) /**< USART3 base address  */
#define LEUART0_BASE      (0x4004A000UL) /**< LEUART0 base address  */
#define LETIMER0_BASE     (0x40046000UL) /**< LETIMER0 base address  */
#define CRYOTIMER_BASE    (0x4001E000UL) /**< CRYOTIMER base address  */
#define PCNT0_BASE        (0x4004E000UL) /**< PCNT0 base address  */
#define PCNT1_BASE        (0x4004E400UL) /**< PCNT1 base address  */
#define PCNT2_BASE        (0x4004E800UL) /**< PCNT2 base address  */
#define I2C0_BASE         (0x4000C000UL) /**< I2C0 base address  */
#define I2C1_BASE         (0x4000C400UL) /**< I2C1 base address  */
#define ADC0_BASE         (0x40002000UL) /**< ADC0 base address  */
#define ACMP0_BASE        (0x40000000UL) /**< ACMP0 base address  */
#define ACMP1_BASE        (0x40000400UL) /**< ACMP1 base address  */
#define IDAC0_BASE        (0x40006000UL) /**< IDAC0 base address  */
#define VDAC0_BASE        (0x40008000UL) /**< VDAC0 base address  */
#define CSEN_BASE         (0x4001F000UL) /**< CSEN base address  */
#define LESENSE_BASE      (0x40055000UL) /**< LESENSE base address  */
#define RTCC_BASE         (0x40042000UL) /**< RTCC base address  */
#define WDOG0_BASE        (0x40052000UL) /**< WDOG0 base address  */
#define WDOG1_BASE        (0x40052400UL) /**< WDOG1 base address  */
#define ETM_BASE          (0xE0041000UL) /**< ETM base address  */
#define SMU_BASE          (0x40022000UL) /**< SMU base address  */
#define TRNG0_BASE        (0x4001D000UL) /**< TRNG0 base address  */
#define DEVINFO_BASE      (0x0FE081B0UL) /**< DEVINFO base address */
#define ROMTABLE_BASE     (0xE00FFFD0UL) /**< ROMTABLE base address */
#define LOCKBITS_BASE     (0x0FE04000UL) /**< Lock-bits page base address */
#define USERDATA_BASE     (0x0FE00000UL) /**< User data page base address */

/** @} End of group EFR32FG12P231F1024GM48_Peripheral_Base */

/**************************************************************************//**
 * @defgroup EFR32FG12P231F1024GM48_Peripheral_Declaration  EFR32FG12P231F1024GM48 Peripheral Declarations
 * @{
 *****************************************************************************/

